//-----------------------------------------------------------------------------
// File : asfCommandList.h
// Desc : CommandList Wrapper.
// Copyright(c) Project Asura. All right reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <d3d12.h>


namespace asf {

///////////////////////////////////////////////////////////////////////////////
// ICommandList interface
///////////////////////////////////////////////////////////////////////////////
struct ICommandList
{
    //-------------------------------------------------------------------------
    //! @brief      デストラクタです.
    //-------------------------------------------------------------------------
    virtual ~ICommandList() {}

    //-------------------------------------------------------------------------
    //! @brief      参照カウンタを増やします.
    //-------------------------------------------------------------------------
    virtual void AddRef() = 0;

    //-------------------------------------------------------------------------
    //! @brief      解放処理を行います.
    //-------------------------------------------------------------------------
    virtual void Release() = 0;

    //-------------------------------------------------------------------------
    //! @brief      リセット処理を行います.
    //! 
    //! @return     D3D12グラフィックスコマンドリストを返却します.
    //-------------------------------------------------------------------------
    virtual ID3D12GraphicsCommandList6* Reset() = 0;

    //-------------------------------------------------------------------------
    //! @brief      D3D12グラフィックスコマンドリストを取得します.
    //! 
    //! @return     D3D12グラフィックスコマンドリストを返却します.
    //-------------------------------------------------------------------------
    virtual ID3D12GraphicsCommandList6* GetD3D12GraphicsCommandList() const = 0;
};

//-----------------------------------------------------------------------------
//! @brief      コマンドリストを生成します.
//! 
//! @param[in]      pDevice     デバイスです.
//! @param[in]      type        コマンドリストタイプです.
//! @param[out]     ppCmdList   コマンドリストの格納先です.
//! @retval true    コマンドリストの生成に成功.
//! @retval false   コマンドリストの生成に失敗.
//-----------------------------------------------------------------------------
bool CreateCommandList(ID3D12Device* pDevice, D3D12_COMMAND_LIST_TYPE type, ICommandList** ppCmdList);

} // namespace asf
